app/controllers/posts_controller.rb

SELECT * FROM `sections` WHERE (`sections`.`id` = 31989848)
---
  def index
    @section = Section.find(params[:section_id]) unless params[:section_id].nil?

SELECT * FROM `posts` WHERE (`posts`.`id` = 1)
---
  def show
    @post = Post.find(params[:id])

SELECT * FROM `posts` WHERE (`posts`.`id` = 980190962)
---
  def edit
    @post = Post.find(params[:id])

INSERT INTO `posts` (`created_at`, `tittle`, `updated_at`, `section_id`, `user_id`, `content`) VALUES('2010-01-07 16:59:47', 'sdsd', '2010-01-07 16:59:47', 31989848, 127326141, 'sdsd')
---
  def create
    @post = Post.new(params[:post])
    @post.user= @user
    respond_to do |format|
      if @post.save

SELECT * FROM `posts` WHERE (`posts`.`id` = 980190962)
UPDATE `posts` SET `updated_at` = '2010-01-07 18:57:42', `section_id` = 1058727635 WHERE `id` = 980190962
---
  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])

SELECT * FROM `posts` WHERE (`posts`.`id` = 980190965)
DELETE FROM `posts` WHERE `id` = 980190965
---
  def destroy
    @post = Post.find(params[:id])
    @post.destroy