app/controllers/replies_controller.rb

SELECT * FROM `replies`
---
  def index
    @replies = Reply.all

INSERT INTO `replies` (`created_at`, `updated_at`, `post_id`, `user_id`, `content`) VALUES('2010-01-07 15:04:31', '2010-01-07 15:04:31', 1, 1, 'asdas')
---
  def create
    @reply = Reply.new(params[:reply])
    @reply.post= current_post
    @reply.user= current_user
    respond_to do |format|
      if @reply.save