app/controllers/sections_controller.rb

  def index
    @sections = Section.all
---
SELECT * FROM `sections`