app/controllers/users_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 1)
---
  def edit
    @user = User.find(params[:id])

INSERT INTO `users` (`created_at`, `hash_password`, `updated_at`, `username`, `sex`, `email`) VALUES('2010-01-07 13:37:57', 'qqq', '2010-01-07 13:37:57', 'zhuzhe', 'male', 'zhuzheiswho@sina.com')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT * FROM `users` WHERE (`users`.`id` = 127326141)
---
  def update
    @user = User.find(params[:id])